Tekla Open API Reference for Tekla Structures 2025
AnalysisModelDesignProperties.ConcreteDesignMethod Property
 The concrete design method.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModelDesignProperties.DesignMethodEnum ConcreteDesignMethod { get; set; }
Public Property ConcreteDesignMethod As AnalysisModelDesignProperties.DesignMethodEnum
	Get
	Set
Property Value
Type: AnalysisModelDesignProperties.DesignMethodEnum
See Also
Reference
AnalysisModelDesignProperties Class
Tekla.Structures.Analysis Namespace